Repository: RaafatAlmasalmeh21/ios_App
Catalog: AiTrading/Resources/*.lproj/Localizable.strings
Languages: ar

# app_title
source: AI Trading Assistant
ar: مساعد التداول بالذكاء الاصطناعي

# app_subtitle
source: Analyze charts with AI-powered insights
ar: تحليل الرسوم البيانية باستخدام الذكاء الاصطناعي

source: How It Works
ar: كيف يعمل

# how_it_works_description
source: Capture a candlestick chart using your camera, then use AI to get analysis at basic, intermediate, or advanced levels. Calculate optimal position sizes based on your risk tolerance.
ar: التقط رسماً بيانياً باستخدام الكاميرا، ثم استخدم الذكاء الاصطناعي للحصول على تحليل بمستويات أساسية أو متوسطة أو متقدمة. احسب أحجام المراكز المثلى بناءً على تحملك للمخاطر.

source: Capture Chart
ar: التقاط الرسم البياني

# capture_chart_description
source: Take a photo of a chart for AI analysis
ar: التقط صورة للرسم البياني للتحليل بالذكاء الاصطناعي

source: Select Chart
ar: اختيار الرسم البياني

# select_chart_description
source: Choose a chart image from your photo library
ar: اختر صورة الرسم البياني من مكتبة الصور

source: Trading Calculator
ar: حاسبة التداول

# trading_calculator_description
source: Calculate position size and risk metrics
ar: حساب حجم المركز ومقاييس المخاطر

source: Analysis History
ar: سجل التحليلات

# analysis_history_description
source: View your previous chart analyses
ar: عرض تحليلات الرسوم البيانية السابقة

source: Chart Capture
ar: التقاط الرسم البياني

# position_chart
source: Position the chart within the frame
ar: ضع الرسم البياني داخل الإطار

source: Select from Gallery
ar: اختر من المعرض

source: Take Photo
ar: التقط صورة

source: Back
ar: رجوع

source: Analyze
ar: تحليل

source: Basic
ar: أساسي

source: Intermediate
ar: متوسط

source: Advanced
ar: متقدم

# basic_description
source: General market trend with basic recommendations
ar: اتجاه السوق العام مع توصيات أساسية

# intermediate_description
source: Entry/exit points and essential indicators
ar: نقاط الدخول/الخروج والمؤشرات الأساسية

# advanced_description
source: Detailed insights and pattern analysis
ar: رؤى مفصلة وتحليل الأنماط

source: Chart Analysis
ar: تحليل الرسم البياني

source: Level: %@
ar: المستوى: %@

source: Analyzed on %@
ar: تم التحليل في %@

source: Analyzing chart...
ar: جاري تحليل الرسم البياني...

# error_title
source: Error: %@
ar: خطأ: %@

source: Analysis
ar: تحليل

source: Market Trend
ar: اتجاه السوق

source: Confidence:
ar: الثقة:

source: Recommendation
ar: التوصية

source: Key Price Levels
ar: مستويات السعر الرئيسية

source: Entry:
ar: الدخول:

source: Exit:
ar: الخروج:

source: Support:
ar: الدعم:

source: Resistance:
ar: المقاومة:

source: Technical Indicators
ar: المؤشرات الفنية

source: Patterns Detected
ar: الأنماط المكتشفة

source: Detailed Analysis
ar: تحليل مفصل

source: Bullish
ar: صاعد

source: Bearish
ar: هابط

source: Sideways
ar: جانبي

source: Done
ar: تم

source: Cancel
ar: إلغاء

# trading_calculator_title
source: Trading Calculator
ar: حاسبة التداول

source: Price Levels
ar: مستويات السعر

source: Entry Price
ar: سعر الدخول

source: Stop Loss
ar: وقف الخسارة

source: Take Profit
ar: جني الأرباح

source: Account Settings
ar: إعدادات الحساب

source: Trading Capital
ar: رأس المال

source: Risk Percentage
ar: نسبة المخاطرة

source: Calculation Results
ar: نتائج الحساب

source: Risk/Reward Ratio
ar: نسبة المخاطرة/العائد

source: Position Size
ar: حجم المركز

source: Potential Profit
ar: الربح المحتمل

source: Potential Loss
ar: الخسارة المحتملة

# profit_loss_percentage
source: Profit/Loss %
ar: نسبة الربح/الخسارة %

source: Trade Assessment
ar: تقييم الصفقة

source: Risk Assessment:
ar: تقييم المخاطر:

source: Good Trade
ar: صفقة جيدة

source: Average Trade
ar: صفقة متوسطة

source: Poor Risk/Reward
ar: نسبة مخاطرة/عائد سيئة

# good_trade_description
source: A good trade typically has a risk/reward ratio of 1:2 or better, meaning the potential profit is at least twice the potential loss.
ar: الصفقة الجيدة عادة ما تكون بنسبة مخاطرة/عائد 1:2 أو أفضل، مما يعني أن الربح المحتمل هو ضعف الخسارة المحتملة على الأقل.

# bullish_basic
source: The market appears to be bullish. Consider looking for buying opportunities on dips.
ar: يبدو أن السوق صاعد. ننصح بالبحث عن فرص شراء عند الانخفاضات.

# bearish_basic
source: The market shows bearish characteristics. Consider reducing exposure or looking for shorting opportunities.
ar: يُظهر السوق خصائص هبوطية. ننصح بتقليل التعرض أو البحث عن فرص للبيع.

# sideways_basic
source: The market is trading sideways. Wait for a breakout or consider range trading strategies.
ar: السوق يتداول بشكل جانبي. انتظر الاختراق أو انظر في استراتيجيات التداول داخل النطاق.

# bullish_intermediate
source: Strong bullish signals detected. Entry point identified with support at key levels. Target the indicated exit point with a stop loss below support.
ar: تم اكتشاف إشارات صعود قوية. تم تحديد نقطة الدخول مع الدعم عند المستويات الرئيسية. استهدف نقطة الخروج المشار إليها مع وقف خسارة أسفل الدعم.

# bearish_intermediate
source: Clear bearish signals present. Consider short positions at the indicated entry with a stop loss above nearest resistance level.
ar: إشارات هبوطية واضحة. ننصح بمراكز بيع عند نقطة الدخول المشار إليها مع وقف خسارة فوق مستوى المقاومة الأقرب.

# sideways_intermediate
source: Market is consolidating. Watch for breakout above resistance or breakdown below support for trading opportunities.
ar: السوق في مرحلة تجميع. راقب الاختراق فوق المقاومة أو الانهيار تحت الدعم للحصول على فرص تداول.

# bullish_advanced
source: Strong bullish confirmation with multiple technical indicators aligned. Pattern analysis shows a high probability setup. Consider the detailed entry and exit strategy with proper position sizing as calculated.
ar: تأكيد صعودي قوي مع توافق العديد من المؤشرات الفنية. يُظهر تحليل النمط إعداداً عالي الاحتمالية. ننصح باستراتيجية الدخول والخروج المفصلة مع تحجيم المركز المناسب كما تم حسابه.

# bearish_advanced
source: Multiple bearish signals confirmed across different timeframes. Risk is elevated with key technical levels broken. Implement suggested position sizing and risk management.
ar: تم تأكيد العديد من الإشارات الهبوطية عبر أطر زمنية مختلفة. المخاطر مرتفعة مع كسر المستويات الفنية الرئيسية. طبق حجم المركز المقترح وإدارة المخاطر.

# sideways_advanced
source: Complex consolidation pattern detected. Multiple support and resistance levels identified. Consider the options strategies or wait for the indicated breakout signals.
ar: تم اكتشاف نمط تجميع معقد. تم تحديد مستويات دعم ومقاومة متعددة. ننصح بالنظر في استراتيجيات الخيارات أو انتظار إشارات الاختراق المشار إليها.

source: Select Language
ar: اختر اللغة

source: History
ar: السجل

source: Show AI Response
ar: عرض استجابة الذكاء الاصطناعي

source: Hide AI Response
ar: إخفاء استجابة الذكاء الاصطناعي

# gemini_flash_analysis
source: Gemini 2.0 Flash Analysis
ar: تحليل جيميني 2.0 فلاش

# powered_by_gemini
source: Analysis powered by Google Gemini 2.0 Flash
ar: التحليل مدعوم بواسطة جوجل جيميني 2.0 فلاش
